# 5_ablation_Full_A6_RDSC3k2.yaml
nc: 6
scales:
  n: [0.50, 0.22, 1024]

backbone:
  - [-1, 1, Conv,     [64, 3, 2]]
  - [-1, 1, Conv,     [128, 3, 2]]

  # 256 stage (keep c3k=False)
  - [-1, 2, RDSC3k2,  [256, False, 0.25, False]]
  - [-1, 1, Conv,     [256, 3, 2]]

  # 512 stage (turn on c3k=True)
  - [-1, 2, RDSC3k2,  [512, False, 0.25, True]]
  - [-1, 1, Conv,     [512, 3, 2]]

  - [-1, 2, RDSC3k2,  [512, True, 0.5, True]]
  - [-1, 1, Conv,     [1024, 3, 2]]

  # 1024 stage (turn on c3k=True)
  - [-1, 2, RDSC3k2,  [1024, True, 0.5, True]]

  - [-1, 1, SPPF,     [1024, 5]]
  - [-1, 2, C2PSA,    [1024]]

head:
  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, RDSC3k2,  [512, False, 0.5, True]]

  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, RDSC3k2,  [256, False, 0.5, False]]

  - [1, 1, Conv, [128, 3, 2]]
  - [[16, 17], 1, Concat, [1]]
  - [-1, 1, RDSC3k2,  [1024, False, 0.25, True]]        # P3_out

  # === P2 Branch ===
  - [19, 1, DySample, [2, 'lp']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 1, 1]]                          # P2_out pre
  - [22, 1, RDSC3k2,  [256, False, 0.25, False]]         # P2 refine

  # === Bottom Up ===
  - [19, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, RDSC3k2,  [512, False, 0.5, True]]

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, RDSC3k2,  [1024, True, 0.5, True]]

  - [26, 1, nn.Identity, []]
  - [29, 1, nn.Identity, []]

  - [[23, 19, 30, 31], 1, DetectLitePDW, [nc]]
