nc: 6
scales:
  n: [0.50, 0.22, 1024]

backbone:
  - [-1, 1, Conv,    [64, 3, 2]]          #0
  - [-1, 1, Conv,    [128, 3, 2]]
  - [-1, 2, DSC3k2X, [256, False, 0.25]]  #2
  - [-1, 1, Conv,    [256, 3, 2]]
  - [-1, 2, DSC3k2X, [512, False, 0.25]]  #4
  - [-1, 1, Conv,    [512, 3, 2]]
  - [-1, 2, DSC3k2X, [512, True]]         #6
  - [-1, 1, Conv,    [1024, 3, 2]]
  - [-1, 2, DSC3k2X, [1024, True]]        #8
  - [-1, 1, SPPF,    [1024, 5]]
  - [-1, 2, C2PSA,   [1024]]              #10

head:
  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 6], 1, Concat, [1]]             #12
  - [-1, 2, DSC3k2X, [512, False]]

  - [-1, 1, DySample, [2, 'lp']]          #14
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, DSC3k2X, [256, False]]        #16

  - [1, 1, Conv, [128, 3, 2]]

  - [[16, 17], 1, Concat, [1]]            #18
  - [-1, 1, DSC3k2X, [1024, False, 0.25]]

  - [19, 1, DySample, [2, 'lp']]          #20
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 1, 1]]            #22


  - [22, 1, DSC3k2X, [256, False, 0.25]]

  - [19, 1, Conv, [512, 3, 2]]            #24
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, DSC3k2X, [512, False]]        #26

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]            #38
  - [-1, 2, DSC3k2X, [1024, True]]

  - [26, 1, nn.Identity, []]              #30
  - [29, 1, nn.Identity, []]              #31

  - [[23, 19, 30, 31], 1, DetectLitePDW, [nc]]