# Ultralytics YOLO11n-4Head-Slim (P2, P3, P4, P5)
# 针对 SODA10M 优化：
# 1. 保留 Backbone 标准宽度，以加载 yolo11n.pt 预训练权重
# 2. Neck 部分通道数减半 (Slim)，大幅降低参数量和显存占用
# 3. 保留 P2 层检测极小目标能力

# Parameters
nc: 6  # ⚠️ 记得改成你的类别数
scales:
  n: [0.50, 0.25, 1024]

# Backbone (完全保持原版，确保能加载预训练权重)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10-P5/32

# Head (通道数 "Slim" 化处理)
head:
  # === Top-Down FPN ===
  
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [256, False]] # 13 ⚠️(原512 -> 改为256)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [128, False]] # 16 ⚠️(原256 -> 改为128)

  # P3 -> P2 (极小目标层)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C3k2, [64, False]] # 19 ⚠️(原128 -> 改为64)

  # === Bottom-Up PAN ===

  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]] # 20 ⚠️(通道数匹配下一层)
  - [[-1, 16], 1, Concat, [1]] # cat neck P3
  - [-1, 2, C3k2, [128, False]] # 22 ⚠️(输出 P3: 128通道)

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]] # 23
  - [[-1, 13], 1, Concat, [1]] # cat neck P4
  - [-1, 2, C3k2, [256, False]] # 25 ⚠️(输出 P4: 256通道)

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]] # 26
  - [[-1, 10], 1, Concat, [1]] # cat backbone P5
  - [-1, 2, C3k2, [512, True]] # 28 ⚠️(输出 P5: 512通道，原1024)

  # Detect Head
  # 输入通道数自动适配：[64, 128, 256, 512]
  - [[19, 22, 25, 28], 1, Detect, [nc]]
