# 2_ablation_DSC3k2.yaml
nc: 6
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, DSC3k2, [256, False, 0.25]] # Changed
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, DSC3k2, [512, False, 0.25]] # Changed
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, DSC3k2, [512, True]]        # Changed
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, DSC3k2, [1024, True]]       # Changed
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, False]]       # Changed

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [256, False]]       # Changed (P3)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, False]]       # Changed (P4)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [1024, True]]       # Changed (P5)

  - [[16, 19, 22], 1, Detect, [nc]]     # Still Standard Detect