# A2: A1 + DS-C3k2 (C3k2 -> DSC3k2)

nc: 6
scales:
  n: [0.50, 0.22, 1024]

backbone:
  - [-1, 1, Conv,   [64, 3, 2]]
  - [-1, 1, Conv,   [128, 3, 2]]
  - [-1, 2, DSC3k2, [256, False, 0.25]]         # P2
  - [-1, 1, Conv,   [256, 3, 2]]
  - [-1, 2, DSC3k2, [512, False, 0.25]]         # P3
  - [-1, 1, Conv,   [512, 3, 2]]
  - [-1, 2, DSC3k2, [512, True]]                # P4
  - [-1, 1, Conv,   [1024, 3, 2]]
  - [-1, 2, DSC3k2, [1024, True]]
  - [-1, 1, SPPF,   [1024, 5]]
  - [-1, 2, C2PSA,  [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [256, False]]

  - [1, 1, Conv, [128, 3, 2]]

  - [[16, 17], 1, Concat, [1]]
  - [-1, 1, DSC3k2, [1024, False, 0.25]]        # P3_out

  - [19, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [22, 1, nn.Identity, []]                    # no HFPLite

  - [19, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, False]]               # P4_out

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [1024, True]]               # P5_out

  - [26, 1, nn.Identity, []]
  - [29, 1, nn.Identity, []]

  - [[23, 19, 30, 31], 1, DetectLitePDW, [nc]]
