# YOLOv11 + P2 scale + Clean Detail Alignment (CDA)
#     nearest upsample + C3k2 + Detect, no HFPLite, no EMA

nc: 6

scales:
  n: [0.50, 0.22, 1024]

backbone:
  - [-1, 1, Conv,   [64, 3, 2]]                 # 0
  - [-1, 1, Conv,   [128, 3, 2]]                # 1
  - [-1, 2, C3k2,   [256, False, 0.25]]         # 2 (P2, s=4)
  - [-1, 1, Conv,   [256, 3, 2]]                # 3
  - [-1, 2, C3k2,   [512, False, 0.25]]         # 4 (P3, s=8)
  - [-1, 1, Conv,   [512, 3, 2]]                # 5
  - [-1, 2, C3k2,   [512, True]]                # 6 (P4, s=16)
  - [-1, 1, Conv,   [1024, 3, 2]]               # 7
  - [-1, 2, C3k2,   [1024, True]]               # 8
  - [-1, 1, SPPF,   [1024, 5]]                  # 9
  - [-1, 2, C2PSA,  [1024]]                     # 10 (P5, s=32)

head:
  # ===== Up path =====
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12
  - [-1, 2, C3k2, [512, False]]                 # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15
  - [-1, 2, C3k2, [256, False]]                 # 16 (P3 semantic)

  # ===== Clean detail alignment branch =====
  - [1, 1, Conv, [128, 3, 2]]                   # 17 (P3 detail)

  # ===== P3 fusion =====
  - [[16, 17], 1, Concat, [1]]                  # 18
  - [-1, 1, C3k2, [1024, False, 0.25]]          # 19 (P3_out)

  # ===== P2 head feature =====
  - [19, 1, nn.Upsample, [None, 2, "nearest"]]  # 20
  - [[-1, 2], 1, Concat, [1]]                   # 21
  - [-1, 1, Conv, [256, 1, 1]]                  # 22 (P2_out)
  - [22, 1, nn.Identity, []]                    # 23 (no HFPLite)

  # ===== Down path =====
  - [19, 1, Conv, [512, 3, 2]]                  # 24
  - [[-1, 13], 1, Concat, [1]]                  # 25
  - [-1, 2, C3k2, [512, False]]                 # 26 (P4_out)

  - [-1, 1, Conv, [1024, 3, 2]]                 # 27
  - [[-1, 10], 1, Concat, [1]]                  # 28
  - [-1, 2, C3k2, [1024, True]]                 # 29 (P5_out)

  # ===== EMA (off) =====
  - [26, 1, nn.Identity, []]                    # 30
  - [29, 1, nn.Identity, []]                    # 31

  # ===== Detect =====
  - [[23, 19, 30, 31], 1, Detect, [nc]]         # 32 (P2,P3,P4,P5)
