# YOLOv11n-12-18-1-GSConv
# 核心策略: 
# 1. Detail Branch 使用 GSConv 进行"保真"下采样
# 2. Gate 融合使用 GhostConv 降参
# 3. 总体 GFLOPs 预计从 11.5 降至 8.x

# Parameters
nc: 6 
scales: 
  n: [0.50, 0.25, 1024] 

# Backbone (保持不变，稳扎稳打)
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head
head:
  # === DySample 上采样 (保持 12-13-2 的优秀设计) ===
  - [-1, 1, DySample, [2, 'lp']] # 11
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, DySample, [2, 'lp']] # 14
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] # 16 (P3 语义流)

  # === 🆕 GSConv 进化的 Detail Branch ===
  - [1, 1, RFAConv, [128]] # 17 (P2 Attention, 聚焦特征)
  
  # 🔥 [核心修改] 使用 GSConv 进行下采样
  # 参数解析: [128, 3, 2] -> out_channels=128, kernel=3, stride=2
  # 优势: 相比普通 Conv，计算量减半；相比 DWConv，保留了通道间的纹理联系
  - [-1, 1, GSConv, [128, 3, 2]] # 18 

  # === Gate 融合 ===
  # ⚠️ 请确保你的 FrequencyGate 代码已修改为使用 GhostConv (见上一个回复)
  # 如果没改代码，这里依然可以用，只是 GFLOPs 降得少一点点
  - [[16, 18], 1, FrequencyGate, [128, 256]] # 19 (Gate 输出 256)

  # === 输出路径 ===
  - [19, 1, Conv, [256, 3, 2]] # 20 (这里也可以激进地换成 GSConv，但建议先稳一手)
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 22

  - [-1, 1, Conv, [512, 3, 2]] 
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] # 25

  - [[19, 22, 25], 1, Detect, [nc]]
