# YOLOv11n-GSConv-Full-Optimization
nc: 6 
scales: 
  n: [0.50, 0.25, 1024] 

# Backbone (不变)
backbone:
  - [-1, 1, Conv, [64, 3, 2]] 
  - [-1, 1, Conv, [128, 3, 2]] 
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] 
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] 
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] 
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] 
  - [-1, 2, C2PSA, [1024]] 

# Head
head:
  # UpSample & Concat (不变)
  - [-1, 1, DySample, [2, 'lp']] 
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] 

  - [-1, 1, DySample, [2, 'lp']] 
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] # 16

  # === Detail Branch ===
  - [1, 1, RFAConv, [128]] 
  - [-1, 1, GSConv, [128, 3, 2]] # 18 (你已经改好的，保持)

  # === Gate ===
  - [[16, 18], 1, FrequencyGate, [128, 256]] # 19

  # === 📉 核心降参点 1 ===
  # 原来是 Conv，参数量 147k。现在换成 GSConv，预计降至 75k 左右。
  - [19, 1, GSConv, [256, 3, 2]] # 20 (Gate -> P4 下采样)

  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 22

  # === 📉 核心降参点 2 ===
  # 原来是 Conv，参数量 147k。现在换成 GSConv。
  - [-1, 1, GSConv, [512, 3, 2]] # 23 (P4 -> P5 下采样)

  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] # 25

  - [[20, 22, 25], 1, Detect, [nc]] # 注意：这里第一个输入索引要跟着变，指向 Layer 20
