# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Hybrid-Attention-YOLO
# --------------------------------------------------------
# 核心策略: "分层治理"
# 1. P3层 (检测三轮车): 
#    ❌ 禁用 EMA (避免全局平均抹杀极小目标)。
#    ✅ 保持纯净或使用 SimAM (点对点增强)。
# 2. P4/P5层 (检测行人/骑行者): 
#    ✅ 启用 EMA (增强模糊热源目标的特征聚合)。
# 3. Detail Branch: 锁定 Conv 下采样 (Tricycle 0.2295 的基石)。
# --------------------------------------------------------

# Parameters
nc: 6 
scales: 
  n: [0.50, 0.25, 1024] 

# Backbone (C3k2 原生，不动)
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (Raw)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4 (Refined)

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head
head:
  # === DySample 上采样 ===
  - [-1, 1, DySample, [2, 'lp']] # 11
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, DySample, [2, 'lp']] # 14
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] # 16 (P3 语义流)

  # === Detail Branch (12-13-2 的核心) ===
  # 保持不动！这是 0.2295 的来源
  - [2, 1, RFAConv, [128]] # 17 (源头 Layer 2)
  - [-1, 1, Conv, [128, 3, 2]] # 18 (Conv 下采样)

  # === Gate 融合 ===
  - [[16, 18], 1, FrequencyGate, [128, 256]] # 19

  # === Neck Output Path ===
  - [19, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 22 (P4 feat)

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] # 25 (P5 feat)

  # ==========================================
  # 🚀 [混合注意力策略] Hybrid Attention
  # ==========================================
# 对 P3 (小目标): 用 SimAM 保护 Tricycle
  # ❌ 之前是: - [19, 1, SimAM, []] -> 报错
  # ✅ 改为: 显式指定通道数 [256]
  - [19, 1, SimAM, [256]] # 26 

  # 对 P4 (中目标): 用 EMA 聚合模糊热源
  # ❌ 之前是: - [22, 1, EMA, []]
  # ✅ 改为: 显式指定通道数 [512]
  - [22, 1, EMA, [512]] # 27 

  # 对 P5 (大目标): 用 EMA 增强全局语义
  # ❌ 之前是: - [25, 1, EMA, []]
  # ✅ 改为: 显式指定通道数 [1024]
  - [25, 1, EMA, [1024]] # 28 

  # Detect (输入变成增强后的层)
  - [[26, 27, 28], 1, Detect, [nc]]