# =============================================================================
# YOLOv11n - Optimized Orange Logic
# Base: 12-13-2 (Orange Line)
# Strategy: 
# 1. KEEP DySample (Proven necessary for aligning with Layer 1 features)
# 2. KEEP Layer 1 Input (Proven necessary for Tricycle)
# 3. REDUCE GFLOPs: Use 1x1 Conv to squeeze channels 128->64 BEFORE RFAConv.
#    Result: RFAConv computation drops by 75% (1/4 cost).
# =============================================================================

# Parameters
nc: 6 
scales: 
  n: [0.50, 0.25, 1024] 

# Backbone (Do not touch)
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (Source: 160x160)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head
head:
  # === P5 -> P4 (DySample 保留！) ===
  - [-1, 1, DySample, [2, 'lp']] # 11
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 13

  # === P4 -> P3 (DySample 保留！) ===
  - [-1, 1, DySample, [2, 'lp']] # 14
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] # 16 (P3 语义流)

  # === 💡 Detail Branch (降本增效核心) ===
  # 之前这里直接跑 RFAConv(128)，导致 GFLOPs 11.5。
  # 现在：
  
  # Step 1: 先用极低成本的 1x1 Conv 把通道压缩一半 (128 -> 64)
  # 注意：分辨率依然是 160x160，三轮车轮廓没丢！
  - [1, 1, Conv, [64, 1, 1]] # 17 (Out: 160x160x64)
  
  # Step 2: 跑 RFAConv，但现在是 64 通道
  # 计算量 = 原来的 1/4！
  - [-1, 1, RFAConv, [64]] # 18 
  
  # Step 3: 下采样对接 P3
  - [-1, 1, Conv, [64, 3, 2]] # 19 (Out: 80x80x64)

  # === Gate 融合 ===
  # 注意：这里输入变成了 [256, 64]，FrequencyGate 会自动处理
  - [[16, 19], 1, FrequencyGate, [256, 64]] # 20 

  # === 输出路径 ===
  - [20, 1, Conv, [256, 3, 2]] # 21
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 23

  - [-1, 1, Conv, [512, 3, 2]] # 24
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] # 26

  - [[20, 23, 26], 1, Detect, [nc]] # 27
