# =============================================================================
# YOLOv11n - HighRes Engine + FrequencyGate (The Real Flagship)
# Strategy: 
# 1. HighRes Engine: Process 160x160 features heavily (C3k2).
# 2. Main Neck: Standard P4->P3 upsampling.
# 3. FUSION: Use FrequencyGate to merge [Main P3] and [HighRes Detail].
#    (Bringing back the "Smart Fusion" logic from 12-13-2).
# =============================================================================

# Parameters
nc: 6 
scales: 
  n: [0.50, 0.25, 1024] 

# Backbone (Standard)
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (Source A)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8 (Source B)
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head
head:
  # === ☢️ High-Res Engine (保留这个强力引擎) ===
  - [1, 1, RFAConv, [128]] # 11 (160x160)
  - [[1, 11], 1, Concat, [1]] # 12 (128+128=256ch)
  - [-1, 2, C3k2, [256, False, 0.25]] # 13 (High-Res Processing)
  - [-1, 1, Conv, [256, 3, 2]] # 14 (Out: 80x80x256, Ready for Gate)

  # === Standard P5 -> P4 ===
  - [10, 1, DySample, [2, 'lp']] # 15
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 17

  # === Standard P4 -> P3 (Main Body) ===
  - [-1, 1, DySample, [2, 'lp']] # 18
  - [[-1, 4], 1, Concat, [1]] # Cat with Backbone P3
  - [-1, 2, C3k2, [256, False]] # 20 (Main P3 Features, 256ch)

  # === ⛩️ The Return of the Gate ===
  # Input 1: Main P3 Body (Layer 20) - 语义较强
  # Input 2: HighRes Engine (Layer 14) - 纹理极强
  # Function: 智能筛选高频细节
  - [[20, 14], 1, FrequencyGate, [256, 256]] # 21 (Gate Fusion)

  # === Output Path ===
  # 注意：Gate 出来后直接进 Conv 下采样，或者直接输出
  - [21, 1, Conv, [256, 3, 2]] # 22 (Downsample for P4)
  - [[-1, 17], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 24

  - [-1, 1, Conv, [512, 3, 2]] # 25
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] # 27

  # Detect: P3(Gate结果), P4, P5
  - [[21, 24, 27], 1, Detect, [nc]] # 28
