# =========================================================
# Model: 12-23-2EMA-RWCFuseLiteP3-Fairn
# Date : 2025-12-23
# Goal : Fair comparison with old experiments
#        Detect channels -> [256, 128, 256]
# =========================================================

nc: 6

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                 # 0
  - [-1, 1, Conv, [128, 3, 2]]                # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]         # 2
  - [-1, 1, Conv, [256, 3, 2]]                # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]         # 4
  - [-1, 1, Conv, [512, 3, 2]]                # 5-P4/16
  - [-1, 2, C3k2, [512, True]]                # 6
  - [-1, 1, Conv, [1024, 3, 2]]               # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]               # 8
  - [-1, 1, SPPF, [1024, 5]]                  # 9
  - [-1, 2, C2PSA, [1024]]                    # 10

head:
  # ===== Up path (same as your baseline) =====
  - [-1, 1, DySample, [2, 'lp']]              # 11
  - [[-1, 6], 1, Concat, [1]]                 # 12
  - [-1, 2, C3k2, [512, False]]               # 13  (P4 head feat)

  - [-1, 1, DySample, [2, 'lp']]              # 14
  - [[-1, 4], 1, Concat, [1]]                 # 15
  - [-1, 2, C3k2, [256, False]]               # 16  (P3 semantic feat) -> 64ch under n

  # ===== Detail branch (same as your baseline) =====
  - [1, 1, RFAConv, [128]]                    # 17  -> 32ch under n
  - [-1, 1, Conv, [128, 3, 2]]                # 18  -> 32ch under n

  # ===== P3 Fusion (NEW, outputs c_sem=64 under n) =====
  # args: [r, proj_groups]
  - [[16, 18], 1, RWCFuseLite, [16, 2]]       # 19  -> 64ch

  # ===== Fairness key: lift P3 to 256ch for Detect (same as your old Conv[1024,1,1]) =====
  - [19, 1, Conv, [1024, 1, 1]]               # 20  -> 256ch  (P3_out_for_Detect)

  # ===== Down path =====
  # from lifted P3 (256) downsample to P4 path
  - [20, 1, Conv, [512, 3, 2]]                # 21  -> 128ch
  - [[-1, 13], 1, Concat, [1]]                # 22
  - [-1, 2, C3k2, [512, False]]               # 23  -> 128ch (P4_out)

  # to P5 path
  - [-1, 1, Conv, [1024, 3, 2]]               # 24  -> 256ch
  - [[-1, 10], 1, Concat, [1]]                # 25
  - [-1, 2, C3k2, [1024, True]]               # 26  -> 256ch (P5_out)

  # ===== EMA only on P4/P5 =====
  - [23, 1, EMA, []]                          # 27
  - [26, 1, EMA, []]                          # 28

  # ===== Detect: now channels are [256,128,256] =====
  - [[20, 27, 28], 1, Detect, [nc]]
