# 12-22-2EMA-noGateConcat (fixed)
# Gate 消融：FrequencyGate -> Concat + 1x1 Conv
# 关键：用 Conv[1024,1,1] 让输出在 width=0.25 下仍为 256

nc: 6
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                  # 0
  - [-1, 1, Conv, [128, 3, 2]]                 # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]                 # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]          # 4
  - [-1, 1, Conv, [512, 3, 2]]                 # 5-P4/16
  - [-1, 2, C3k2, [512, True]]                 # 6
  - [-1, 1, Conv, [1024, 3, 2]]                # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]                # 8
  - [-1, 1, SPPF, [1024, 5]]                   # 9
  - [-1, 2, C2PSA, [1024]]                     # 10

head:
  - [-1, 1, DySample, [2, 'lp']]               # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12
  - [-1, 2, C3k2, [512, False]]                # 13

  - [-1, 1, DySample, [2, 'lp']]               # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15
  - [-1, 2, C3k2, [256, False]]                # 16 (P3 语义流)

  - [1, 1, RFAConv, [128]]                     # 17
  - [-1, 1, Conv, [128, 3, 2]]                 # 18

  # === 无 Gate 融合：Concat + 1x1 Conv(输出保持256) ===
  - [[16, 18], 1, Concat, [1]]                 # 19 (cat)
  - [-1, 1, Conv, [1024, 1, 1]]                # 20 (缩放后=256) 作为 P3 输出 ✅

  # === 输出路径 ===
  - [20, 1, Conv, [256, 3, 2]]                 # 21
  - [[-1, 13], 1, Concat, [1]]                 # 22
  - [-1, 2, C3k2, [512, False]]                # 23 (P4)

  - [-1, 1, Conv, [512, 3, 2]]                 # 24
  - [[-1, 10], 1, Concat, [1]]                 # 25
  - [-1, 2, C3k2, [1024, True]]                # 26 (P5)

  # EMA only on P4/P5
  - [23, 1, EMA, []]                           # 27
  - [26, 1, EMA, []]                           # 28

  - [[20, 27, 28], 1, Detect, [nc]]
