# Parameters
nc: 6 
scales: 
  n: [0.50, 0.25, 1024] 

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head
head:
  # === DySample 上采样  ===
  - [-1, 1, DySample, [2, 'lp']] # 11
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, DySample, [2, 'lp']] # 14
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] # 16 (P3 语义流)

  - [1, 1, RFAConv, [128]] 
  - [-1, 1, Conv, [128, 3, 2]] 

  # === Gate 融合 ===
  - [[16, 18], 1, SGHBSGate, [128, 256]]

  # === 输出路径 ===
  - [19, 1, Conv, [256, 3, 2]] 
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 22

  - [-1, 1, Conv, [512, 3, 2]] 
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] # 25

  - [[19, 22, 25], 1, Detect, [nc]]