# 🧠 参数量 (Params): 2.76 M
# 💻 计算量 (GFLOPs): 8.32
nc: 6
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  
  # 🌟 改动1: P3 层用 StarBlock，增强小目标语义，减少参数
  - [-1, 2, C3k2_Star, [512, False, 0.25]] # 4 -> c2=512 (scaled to 128)
  
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  
  # 🌟 改动2: P4 层也用 StarBlock
  - [-1, 2, C3k2_Star, [512, True]] 
  
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # P5 保持原样，大目标不需要太花哨
  - [-1, 1, SPPF, [1024, 5]] 
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # === DySample 上采样 ===
  - [-1, 1, DySample, [2, 'lp']] # 11
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, DySample, [2, 'lp']] # 14
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] # 16 (P3 语义流, ch=256)

  # === Detail Branch (保持不变，这是三轮车的命根子) ===
  - [1, 1, RFAConv, [128]] 
  - [-1, 1, Conv, [128, 3, 2]] # 18 (Detail, ch=128)

  # === 🌟 改动3: Lite Gate 融合 ===
  # 输入: [Sem=256, Detail=128]
  # 这里的 args 留空或者写 [128] 都可以，代码里我写了默认 output=detail_ch
  # 关键点：这个模块不再做 Concat，所以输出是 128
  - [[16, 18], 1, LiteFrequencyGate, [128]] # 19 -> Output 128 ch

  # === 输出路径修正 ===
  # 因为 Gate 输出变为了 128，而原来的 Detect Head 可能期望这里是 256
  # 所以这里这个 Conv 负责把 128 升维到 256，顺便做特征整合
  - [19, 1, Conv, [256, 3, 2]] # 20
  
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 22

  - [-1, 1, Conv, [512, 3, 2]] 
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] # 25

  - [[19, 22, 25], 1, Detect, [nc]] # Detect 输入 19 (128ch), 22, 25
