# 12_23_RWCFuseLiteP3_P2_ultralite64_fromL2_4scale_2EMA
nc: 6

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                  # 0
  - [-1, 1, Conv, [128, 3, 2]]                 # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]          # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]                 # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]          # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]                 # 5-P4/16
  - [-1, 2, C3k2, [512, True]]                 # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]                # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]                # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]                   # 9
  - [-1, 2, C2PSA, [1024]]                     # 10

head:
  - [-1, 1, DySample, [2, 'lp']]               # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12
  - [-1, 2, C3k2, [512, False]]                # 13

  - [-1, 1, DySample, [2, 'lp']]               # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15
  - [-1, 2, C3k2, [256, False]]                # 16

  - [1, 1, RFAConv, [128]]                     # 17
  - [-1, 1, Conv, [128, 3, 2]]                 # 18

  - [[16, 18], 1, RWCFuseLite, [16, 2]]        # 19
  - [19, 1, Conv, [1024, 1, 1]]                # 20 (P3_out_for_Detect)

  # ===== P2 ultralite (64ch under n), fuse from L2 =====
  - [20, 1, nn.Upsample, [None, 2, "nearest"]] # 21
  - [[-1, 2], 1, Concat, [1]]                  # 22  <-- from layer2
  - [-1, 1, Conv, [256, 1, 1]]                 # 23  (P2_out_for_Detect -> 64ch under n)

  - [20, 1, Conv, [512, 3, 2]]                 # 24
  - [[-1, 13], 1, Concat, [1]]                 # 25
  - [-1, 2, C3k2, [512, False]]                # 26 (P4_out)

  - [-1, 1, Conv, [1024, 3, 2]]                # 27
  - [[-1, 10], 1, Concat, [1]]                 # 28
  - [-1, 2, C3k2, [1024, True]]                # 29 (P5_out)

  - [26, 1, EMA, []]                           # 30
  - [29, 1, EMA, []]                           # 31

  - [[23, 20, 30, 31], 1, Detect, [nc]]        # 32
