# 12_25_RWCFuseLiteP3_P2_4scale_2EMA_DetectLitePDW_HFPLiteP2P3
nc: 6

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [1, 1, RFAConv, [128]]
  - [-1, 1, Conv, [128, 3, 2]]

  - [[16, 18], 1, RWCFuseLite, [16, 2]]
  - [19, 1, Conv, [1024, 1, 1]]                # 20 P3_out

  - [20, 1, DySample, [2, 'lp']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 1, 1]]                 # 23 P2_out

  - [23, 1, HFPLite, []]                       # 24 P2_hfp (only for Detect)
  - [20, 1, HFPLite, []]                       # 25 P3_hfp (only for Detect)

  - [20, 1, Conv, [512, 3, 2]]                 # 26 (same down path uses raw P3_out)
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]                # 28 P4_out

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]                # 31 P5_out

  - [28, 1, EMA, []]                           # 32
  - [31, 1, EMA, []]                           # 33

  - [[24, 25, 32, 33], 1, DetectLitePDW, [nc]] # 34
