# 12_25_RWCFuseLiteP3_P2Refine_noP2Detect_2EMA
# 13.1 GFLOPs
nc: 6

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                  # 0
  - [-1, 1, Conv, [128, 3, 2]]                 # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]          # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]                 # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]          # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]                 # 5-P4/16
  - [-1, 2, C3k2, [512, True]]                 # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]                # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]                # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]                   # 9
  - [-1, 2, C2PSA, [1024]]                     # 10

head:
  # ===== Up path =====
  - [-1, 1, DySample, [2, 'lp']]               # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12
  - [-1, 2, C3k2, [512, False]]                # 13  (P4 head feat)

  - [-1, 1, DySample, [2, 'lp']]               # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15
  - [-1, 2, C3k2, [256, False]]                # 16  (P3 semantic feat)

  # ===== Detail branch =====
  - [1, 1, RFAConv, [128]]                     # 17  from backbone layer 1
  - [-1, 1, Conv, [128, 3, 2]]                 # 18

  # ===== P3 Fusion =====
  - [[16, 18], 1, RWCFuseLite, [16, 2]]        # 19  (P3 fused, ~64ch under n)

  # ============================================================
  # ===== NEW: P2 refine but NO P2 Detect ======================
  # 19 -> upsample to P2, fuse with backbone P2(layer2), then downsample back to P3 and fuse again.
  - [19, 1, DySample, [2, 'lp']]               # 20  (to P2)
  - [[-1, 2], 1, Concat, [1]]                  # 21  fuse with backbone layer2 (recommended by your ablation)
  - [-1, 1, Conv, [256, 1, 1]]                 # 22  compress (-> ~64ch under n)

  - [-1, 1, Conv, [256, 3, 2]]                 # 23  downsample back to P3
  - [[-1, 19], 1, Concat, [1]]                 # 24  fuse with original P3 fused
  - [-1, 1, Conv, [256, 1, 1]]                 # 25  refined P3 (-> ~64ch under n)
  # ============================================================

  # lift P3 to 256ch for Detect (same as your best)
  - [25, 1, Conv, [1024, 1, 1]]                # 26  (P3_out_for_Detect) -> 256ch under n

  # ===== Down path =====
  - [26, 1, Conv, [512, 3, 2]]                 # 27  -> P4 path
  - [[-1, 13], 1, Concat, [1]]                 # 28
  - [-1, 2, C3k2, [512, False]]                # 29  (P4_out)

  - [-1, 1, Conv, [1024, 3, 2]]                # 30  -> P5 path
  - [[-1, 10], 1, Concat, [1]]                 # 31
  - [-1, 2, C3k2, [1024, True]]                # 32  (P5_out)

  # ===== EMA only on P4/P5 =====
  - [29, 1, EMA, []]                           # 33
  - [32, 1, EMA, []]                           # 34

  # ===== Detect: still 3-scale (P3, P4, P5) =====
  - [[26, 33, 34], 1, Detect, [nc]]            # 35
