# 12_25_RWCFuseLiteP3_P2Refine_SimAM_noP2Detect_2EMA
# 13.1 GFLOPs
nc: 6

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                  # 0
  - [-1, 1, Conv, [128, 3, 2]]                 # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]          # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]                 # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]          # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]                 # 5-P4/16
  - [-1, 2, C3k2, [512, True]]                 # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]                # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]                # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]                   # 9
  - [-1, 2, C2PSA, [1024]]                     # 10

head:
  - [-1, 1, DySample, [2, 'lp']]               # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12
  - [-1, 2, C3k2, [512, False]]                # 13

  - [-1, 1, DySample, [2, 'lp']]               # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15
  - [-1, 2, C3k2, [256, False]]                # 16

  - [1, 1, RFAConv, [128]]                     # 17
  - [-1, 1, Conv, [128, 3, 2]]                 # 18

  - [[16, 18], 1, RWCFuseLite, [16, 2]]        # 19

  # ===== P2 refine (no P2 Detect) =====
  - [19, 1, DySample, [2, 'lp']]               # 20
  - [[-1, 2], 1, Concat, [1]]                  # 21
  - [-1, 1, Conv, [256, 1, 1]]                 # 22
  - [-1, 1, Conv, [256, 3, 2]]                 # 23
  - [[-1, 19], 1, Concat, [1]]                 # 24
  - [-1, 1, Conv, [256, 1, 1]]                 # 25

  # ===== NEW: SimAM on refined P3 =====
  - [25, 1, SimAM, []]                         # 26

  # lift for Detect
  - [26, 1, Conv, [1024, 1, 1]]                # 27

  # ===== Down path =====
  - [27, 1, Conv, [512, 3, 2]]                 # 28
  - [[-1, 13], 1, Concat, [1]]                 # 29
  - [-1, 2, C3k2, [512, False]]                # 30

  - [-1, 1, Conv, [1024, 3, 2]]                # 31
  - [[-1, 10], 1, Concat, [1]]                 # 32
  - [-1, 2, C3k2, [1024, True]]                # 33

  - [30, 1, EMA, []]                           # 34
  - [33, 1, EMA, []]                           # 35

  - [[27, 34, 35], 1, Detect, [nc]]            # 36
