# 12_26_RWCFuseLiteP3_DSC3k2_LiteHead
nc: 6

scales:
  # 目标：n ≈ yolo11n(≈2.6M, ≈6.4G) —— 先从0.22起步，跑info再微调
  n: [0.50, 0.22, 1024]
  # s: [0.50, 0.50, 1024]
  # m: [0.50, 1.00, 512]
  # l: [1.00, 1.00, 512]
  # x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,   [64, 3, 2]]               # 0
  - [-1, 1, Conv,   [128, 3, 2]]              # 1-P2/4
  - [-1, 2, DSC3k2, [256, False, 0.25]]       # 2
  - [-1, 1, Conv,   [256, 3, 2]]              # 3-P3/8
  - [-1, 2, DSC3k2, [512, False, 0.25]]       # 4
  - [-1, 1, Conv,   [512, 3, 2]]              # 5-P4/16
  - [-1, 2, DSC3k2, [512, True]]              # 6
  - [-1, 1, Conv,   [1024, 3, 2]]             # 7-P5/32
  - [-1, 2, DSC3k2, [1024, True]]             # 8
  - [-1, 1, SPPF,   [1024, 5]]                # 9
  - [-1, 2, C2PSA,  [1024]]                   # 10  (如果仍偏重，下一步可考虑换轻量注意力)

head:
  # Up path (DySample)
  - [-1, 1, DySample, [2, 'lp']]              # 11
  - [[-1, 6], 1, Concat, [1]]                 # 12
  - [-1, 2, DSC3k2, [512, False]]             # 13  P4 head feat

  - [-1, 1, DySample, [2, 'lp']]              # 14
  - [[-1, 4], 1, Concat, [1]]                 # 15
  - [-1, 2, DSC3k2, [256, False]]             # 16  P3 semantic

  # Detail branch
  - [1, 1, RFAConv, [128]]                    # 17
  - [-1, 1, Conv,   [128, 3, 2]]              # 18

  # P3 fusion
  - [[16, 18], 1, RWCFuseLite, [16, 2]]       # 19

  # Lift P3 for detect (稍微降一点点也行；先按你稳定写法来)
  - [19, 1, Conv, [1024, 1, 1]]               # 20  P3_out

  # Down path
  - [20, 1, Conv, [512, 3, 2]]                # 21
  - [[-1, 13], 1, Concat, [1]]                # 22
  - [-1, 2, DSC3k2, [512, False]]             # 23  P4_out

  - [-1, 1, Conv, [1024, 3, 2]]               # 24
  - [[-1, 10], 1, Concat, [1]]                # 25
  - [-1, 2, DSC3k2, [1024, True]]             # 26  P5_out

  # EMA only on P4/P5
  - [23, 1, EMA, []]                          # 27
  - [26, 1, EMA, []]                          # 28

  # 3-scale lite detect
  - [[20, 27, 28], 1, DetectLitePDW, [nc]]    # 29
