# 12_24_RWCFuseLiteP3_P2_ch48_DySample_fromL2_4scale_2EMA
nc: 6

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [1, 1, RFAConv, [128]]
  - [-1, 1, Conv, [128, 3, 2]]

  - [[16, 18], 1, RWCFuseLite, [16, 2]]
  - [19, 1, Conv, [1024, 1, 1]]                # P3_out 256ch

  - [20, 1, DySample, [2, 'lp']]               # P2_up DySample
  - [[-1, 2], 1, Concat, [1]]                  # fromL2
  - [-1, 1, Conv, [192, 1, 1]]                 # <-- P2_out 48ch under n

  - [20, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [26, 1, EMA, []]
  - [29, 1, EMA, []]

  - [[23, 20, 30, 31], 1, Detect, [nc]]
