# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# SDC-YOLO (Fixed Version)
# --------------------------------------------------------
# 修复了 Stride 匹配错误。
# SDC_Gate 输出的是 P2 尺度 (s4)，需要先降采样回 P3 (s8)，才能继续走 Neck。
# --------------------------------------------------------

# Parameters
nc: 6 
scales: 
  n: [0.50, 0.25, 1024] 

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head
head:
  # === DySample ===
  - [-1, 1, DySample, [2, 'lp']] # 11 (P5 -> P4)
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] # 13 (P4)

  - [-1, 1, DySample, [2, 'lp']] # 14 (P4 -> P3)
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] # 16 (P3 语义)

  # === ScConv ===
  - [1, 1, ScConv, [128]] # 17 (P2)

  # === SDC_Gate (输出是 s4) ===
  - [[16, 17], 1, SDC_Gate, [128, 256]] # 18 (P2 增强版, Stride 4)

  # 🚀 [关键修复] 先把 s4 降回 s8 (P3)
  # 这一层将作为 Detect 头的 P3 输入
  - [18, 1, Conv, [256, 3, 2]] # 19 (Stride 8, P3_Refined)

  # === 继续下采样去 P4 ===
  # P3_Refined (19) -> P4
  - [19, 1, Conv, [256, 3, 2]] # 20 (Stride 16)
  - [[-1, 13], 1, Concat, [1]] # 21 (Stride 16 + Stride 16) ✅ 匹配成功
  - [-1, 2, C3k2, [512, False]] # 22 (P4_Refined)

  # === 继续下采样去 P5 ===
  # P4_Refined (22) -> P5
  - [-1, 1, Conv, [512, 3, 2]] # 23 (Stride 32)
  - [[-1, 10], 1, Concat, [1]] # 24
  - [-1, 2, C3k2, [1024, True]] # 25 (P5_Refined)

  # === Detect ===
  # 注意层号变了: 19(P3), 22(P4), 25(P5)
  - [[19, 22, 25], 1, Detect, [nc]]