# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11-SPD-Conv + DySample
# 策略: 
# 1. 下采样用 SPD-Conv (保住小目标的信息，不丢失像素)
# 2. 上采样用 DySample (精准恢复细节)

# Parameters
nc: 6 # SODA10M
scales: 
  n: [0.50, 0.25, 1024] 

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 (第一层图像很大，保留普通卷积没问题)
  
  # ⬇️ [替换] P2 下采样: 原本是 Conv(s=2) -> 换成 SPDConv
  - [-1, 1, SPDConv, [128]] # 1-P2/4

  - [-1, 2, C3k2, [256, False, 0.25]]
  
  # ⬇️ [替换] P3 下采样 -> SPDConv
  - [-1, 1, SPDConv, [256]] # 3-P3/8

  - [-1, 2, C3k2, [512, False, 0.25]]
  
  # ⬇️ [替换] P4 下采样 -> SPDConv
  - [-1, 1, SPDConv, [512]] # 5-P4/16

  - [-1, 2, C3k2, [512, True]]
  
  # ⬇️ [替换] P5 下采样 -> SPDConv
  - [-1, 1, SPDConv, [1024]] # 7-P5/32

  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head 部分保持你觉得好用的 DySample
head:
  - [-1, 1, DySample, [2, 'lp']] 
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] 

  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] 

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] 

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] 

  - [[16, 19, 22], 1, Detect, [nc]]