# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11-Hybrid (SPD + ADown) + DySample
# 创新点: "混合分层下采样" (Hierarchical Hybrid Downsampling)
# 1. 浅层 (P2/P3) 用 SPD-Conv: 也就是俗称的"显微镜"，不放过任何一个像素，专抓三轮车。
# 2. 深层 (P4/P5) 用 ADown: 也就是"压缩机"，降低计算量，提取高级语义。
# 3. 上采样保持 DySample: 动态恢复细节。

# Parameters
nc: 6 # SODA10M
scales: 
  n: [0.50, 0.25, 1024] 

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  
  # ⬇️ [浅层策略] P2 下采样: 继续使用 SPDConv
  # 这里通道少，算力消耗低，收益高 (保留小目标)
  - [-1, 1, SPDConv, [128]] # 1-P2/4

  - [-1, 2, C3k2, [256, False, 0.25]]
  
  # ⬇️ [过渡策略] P3 下采样: 依然建议保留 SPDConv 或者换成 ADown
  # 为了保三轮车，这里建议还是 SPD，因为 P3 依然包含较多细节
  - [-1, 1, SPDConv, [256]] # 3-P3/8

  - [-1, 2, C3k2, [512, False, 0.25]]
  
  # ⬇️ [深层策略] P4 下采样: ❌ 坚决不用 SPDConv
  # ✅ 换用 ADown (YOLOv9) 或者普通 Conv
  # ADown 既能通过 MaxPool 保留强特征，又能通过 AvgPool 保持背景，比 Conv 好，比 SPD 轻
  - [-1, 1, ADown, [512]] # 5-P4/16

  - [-1, 2, C3k2, [512, True]]
  
  # ⬇️ [深层策略] P5 下采样: ❌ 坚决不用 SPDConv
  # ✅ 换用 ADown
  - [-1, 1, ADown, [1024]] # 7-P5/32

  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head 保持不变 (DySample 非常好，不需要动)
head:
  - [-1, 1, DySample, [2, 'lp']] 
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] 

  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] 

  - [-1, 1, ADown, [256]]
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] 

  - [-1, 1, ADown, [512]]
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] 

  - [[16, 19, 22], 1, Detect, [nc]]
